uyencorki/uvc-ai-stm32/Lib/Camera_Middleware/cmw_camera.c
  gpio_init_structure.Pin       = EN_CAM_PIN;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  HAL_GPIO_Init(EN_CAM_PORT, &gpio_init_structure);

  gpio_init_structure.Pin       = NRST_CAM_PIN;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  HAL_GPIO_Init(NRST_CAM_PORT, &gpio_init_structure);

  /* Camera power down sequence */
  /* Assert the camera Enable pin (active high) */
  HAL_GPIO_WritePin(EN_CAM_PORT, EN_CAM_PIN, GPIO_PIN_RESET);

  /* De-assert the camera NRST pin (active low) */
  HAL_GPIO_WritePin(NRST_CAM_PORT, NRST_CAM_PIN, GPIO_PIN_RESET);

}

static void CMW_CAMERA_ShutdownPin(int value)
{
  HAL_GPIO_WritePin(NRST_CAM_PORT, NRST_CAM_PIN, value ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

static void CMW_CAMERA_EnablePin(int value)
{
  HAL_GPIO_WritePin(EN_CAM_PORT, EN_CAM_PIN, value ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

static ISP_StatusTypeDef CB_ISP_SetSensorGain(uint32_t camera_instance, int32_t gain)
{
  if (CMW_CAMERA_SetGain(gain) != CMW_ERROR_NONE)
    return ISP_ERR_SENSORGAIN;

  return ISP_OK;
}

static ISP_StatusTypeDef CB_ISP_GetSensorGain(uint32_t camera_instance, int32_t *gain)
{
  if (CMW_CAMERA_GetGain(gain) != CMW_ERROR_NONE)
    return ISP_ERR_SENSORGAIN;

  return ISP_OK;
}

static ISP_StatusTypeDef CB_ISP_SetSensorExposure(uint32_t camera_instance, int32_t exposure)
{
  if (CMW_CAMERA_SetExposure(exposure) != CMW_ERROR_NONE)
    return ISP_ERR_SENSOREXPOSURE;

  return ISP_OK;
}

static ISP_StatusTypeDef CB_ISP_GetSensorExposure(uint32_t camera_instance, int32_t *exposure)
{
  if (CMW_CAMERA_GetExposure(exposure) != CMW_ERROR_NONE)
    return ISP_ERR_SENSOREXPOSURE;

  return ISP_OK;
}

static ISP_StatusTypeDef CB_ISP_GetSensorInfo(uint32_t camera_instance, ISP_SensorInfoTypeDef *Info)
{
  if(Camera_Drv.GetSensorInfo != NULL)
  {
    if (Camera_Drv.GetSensorInfo(&camera_bsp, Info) != CMW_ERROR_NONE)
      return ISP_ERR_SENSOREXPOSURE;
  }
  return ISP_OK;
}

static uint32_t CMW_CAMERA_ClampDvpCase(uint32_t case_id)
{
  if (case_id < APP_DVP_CASE_MIN)
  {
    return APP_DVP_CASE_MIN;
  }
  if (case_id > APP_DVP_CASE_MAX)
  {
    return APP_DVP_CASE_MAX;
  }
  return case_id;
}

static void CMW_CAMERA_GetDvpCasePolarityFlags(uint32_t case_id, uint32_t *vs_high, uint32_t *hs_high, uint32_t *pck_rising)
{
  uint32_t case_bits = CMW_CAMERA_ClampDvpCase(case_id) - 1U;

  if (vs_high != NULL)
  {
    *vs_high = ((case_bits & 0x4U) != 0U) ? 1U : 0U;
  }
  if (hs_high != NULL)
  {
    *hs_high = ((case_bits & 0x2U) != 0U) ? 1U : 0U;
  }
  if (pck_rising != NULL)
  {
    *pck_rising = ((case_bits & 0x1U) != 0U) ? 1U : 0U;
  }
}

static void CMW_CAMERA_FillParallelConfigByCase(DCMIPP_ParallelConfTypeDef *parallel_conf, uint32_t case_id)
{
  uint32_t vs_high = 0U;
  uint32_t hs_high = 0U;
  uint32_t pck_rising = 0U;

  if (parallel_conf == NULL)
  {
    return;
  }

  CMW_CAMERA_GetDvpCasePolarityFlags(case_id, &vs_high, &hs_high, &pck_rising);

  parallel_conf->Format = DCMIPP_FORMAT_YUV422;
  parallel_conf->VSPolarity = (vs_high != 0U) ? DCMIPP_VSPOLARITY_HIGH : DCMIPP_VSPOLARITY_LOW;
  parallel_conf->HSPolarity = (hs_high != 0U) ? DCMIPP_HSPOLARITY_HIGH : DCMIPP_HSPOLARITY_LOW;
  parallel_conf->PCKPolarity = (pck_rising != 0U) ? DCMIPP_PCKPOLARITY_RISING : DCMIPP_PCKPOLARITY_FALLING;
  parallel_conf->ExtendedDataMode = DCMIPP_INTERFACE_8BITS;
  parallel_conf->SynchroMode = DCMIPP_SYNCHRO_HARDWARE;
  parallel_conf->SwapBits = DCMIPP_SWAPBITS_DISABLE;
  parallel_conf->SwapCycles = DCMIPP_SWAPCYCLES_DISABLE;
}


static int32_t CMW_CAMERA_DVP_Init(CMW_Sensor_Init_t *initSensors_params)
{
  printf("[CMW] DVP init requested %lux%lu fps=%ld\r\n",
         (unsigned long)initSensors_params->width,
         (unsigned long)initSensors_params->height,
         (long)initSensors_params->fps);
  int32_t ret = CMW_ERROR_NONE;

  CMW_DVP_config_t default_sensor_config = {0};
  CMW_DVP_config_t *sensor_config;
  memset(&Camera_Drv, 0, sizeof(Camera_Drv));

  default_sensor_config.pixel_format = CMW_PIXEL_FORMAT_YUV422_8;
  initSensors_params->sensor_config = initSensors_params->sensor_config ? initSensors_params->sensor_config : &default_sensor_config;
  sensor_config = (CMW_DVP_config_t *)(initSensors_params->sensor_config);
  printf("[CMW] sensor pixel_format=%lu\r\n", (unsigned long)sensor_config->pixel_format);

  if ((initSensors_params->width == 0U) || (initSensors_params->height == 0U))
  {
    initSensors_params->width = 1920;
    initSensors_params->height = 1080;
    printf("[CMW] DVP init defaulted to 1920x1080\r\n");
  }

  /* DVP path: configure parallel receiver. */
  DCMIPP_ParallelConfTypeDef parallel_conf = { 0 };
  uint32_t case_id = CMW_CAMERA_ClampDvpCase(APP_DVP_TEST_CASE);
  uint32_t vs_high = 0U;
  uint32_t hs_high = 0U;
  uint32_t pck_rising = 0U;

  CMW_CAMERA_GetDvpCasePolarityFlags(case_id, &vs_high, &hs_high, &pck_rising);
  CMW_CAMERA_FillParallelConfigByCase(&parallel_conf, case_id);

  if ((uint32_t)APP_DVP_TEST_CASE != case_id)
  {
    printf("[CMW][DVP-TEST] requested case=%lu, clamped to case=%lu\r\n",
           (unsigned long)APP_DVP_TEST_CASE,
           (unsigned long)case_id);
  }

  printf("[CMW][DVP-TEST] case=%lu VSYNC=%s HSYNC=%s PIXCLK=%s-edge\r\n",
         (unsigned long)case_id,
         (vs_high != 0U) ? "active-high" : "active-low",
         (hs_high != 0U) ? "active-high" : "active-low",
         (pck_rising != 0U) ? "rising" : "falling");

  ret = HAL_DCMIPP_PARALLEL_SetConfig(&hcamera_dcmipp, &parallel_conf);
  if (ret != HAL_OK)
  {
    printf("[CMW] DVP parallel config failed=%ld\r\n", (long)ret);
    return CMW_ERROR_PERIPH_FAILURE;
  }

  printf("[CMW] DVP cfg fmt=%lu hspol=%lu vspol=%lu pckpol=%lu if=%lu\r\n",
         (unsigned long)parallel_conf.Format,
         (unsigned long)parallel_conf.HSPolarity,
         (unsigned long)parallel_conf.VSPolarity,
         (unsigned long)parallel_conf.PCKPolarity,
         (unsigned long)parallel_conf.ExtendedDataMode);

  printf("[CMW] DVP init done\r\n");


  return ret;
}

